Repository: golfling/weather-app
Catalog: lib/service/l10n/app_*.arb
Languages: ru

# temperatureUnitWithValue
source: {value}°F
ru: {value}°C

# updateTimeMinutes
source: {count, plural, =0{Just updated} one{Updated {count} minute ago} other{Updated {count} minutes ago}}
ru: {count, plural, =0{Обновлено только что} one{Обновлено {count} минуту назад} few{Обновлено {count} минуты назад} many{Обновлено {count} минут назад} other{Обновлено {count} минуту назад}

# updateTimeHours
source: {count, plural, one{Updated {count} hour ago} other{Updated {count} hours ago}}
ru: {count, plural, one{Обновлено {count} час назад} few{Обновлено {count} часа назад} many{Обновлено {count} часов назад} other{Обновлено {count} час назад}}

# updateTimeDays
source: {count, plural, one{Updated {count} day ago} other{Updated {count} days ago}}
ru: {count, plural, one{Обновлено {count} день назад} few{Обновлено {count} дня назад} many{Обновлено {count} дней назад} other{Обновлено {count} день назад}}

source: Hourly forecast
ru: Прогноз на час

# fielsLikeTemperature
source: Fiels like {count}°F
ru: Ощущается как {count}°C

# timeFormatHours
source: {hours}
ru: {hours}:00

# weekdayTranslate
source: {weekday, select, Mon{Mon} Tue{Tue} Wed{Wed} Thu{Thu} Fri{Fri} Sat{Sat} Sun{Sun}}
ru: {weekday, select, Mon{Пн} Tue{Вт} Wed{Ср} Thu{Чт} Fri{Пт} Sat{Сб} Sun{Вс}}

# monthTranslate
source: {month, select, Jan{Jan} Feb{Feb} Mar{Mar} Apr{Apr} May{May} Jun{Jun} Jul{Jul} Aug{Aug} Sep{Sep} Oct{Oct} Nov{Nov} Dec{Dec}}
ru: {month, select, Jan{Янв} Feb{Фев} Mar{Мар} Apr{Апр} May{Май} Jun{Июн} Jul{Июл} Aug{Авг} Sep{Сен} Oct{Окт} Nov{Ноя} Dec{Дек}}

# noNetConnection
source: Please check your internet connection.
ru: Пожалуйста, проверьте ваше подключение к Интернету.

# noNetConnectionNotification
source: No internet connection
ru: Нет подключения к Интернету

# noGeolocationInfo
source: Please enable location services
ru: Пожалуйста, включите службы определения местоположения

# enterCity
source: Enter a city
ru: Введите название города

# smthWentWrong
source: Something went wrong.
ru: Что-то пошло не так.

source: Nothing found.
ru: Ничего не найдено.
